# Задча Easy
# Задача №1
print('ЗАДАЧА 1 (Easy)')

a = input('В каком городе вы живете?: ')
print('А я живу в Иркутске')
b = input('Как вас зовут?: ')
print('Привет', b + "!")

print('============================================================')
# задача №2
print('ЗАДАЧА 2 (Easy)')

number = int(input('Введите число, а я прибавлю к нему 2: '))
print(number + 2)

print('============================================================')
# Задача №3
print('ЗАДАЧА 3 (Easy)')

age = int(input('Введите ваш возраст: '))
if age >= 18:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом только с 18 лет')




#Задача Normal
print('============================================================')
print('ЗАДАЧА 1 (Normal)')

while True:
    a = int(input('введите число: '))
    if 0 < a < 10:
        print(a ** 2)
        break
    print('число должно быть меньше 10 и больше 0')
    if 10 < a < 0:
        continue
print('============================================================')
print('ЗАДАЧА 2 (Normal)')

a = input('введите значене x: ')
b = input('введите значение y: ')

print('x =', b)
print('y =', a)
print('============================================================')

#Задача Hard


print('МЕДЕЦИНСКАЯ АНКЕТА')

print('впишите 0 в строке "Впишите свой номер" для завершения программы')

while True:

    number = input('Впишите свой номер: ')

    if number == '0':
        print('Конец приема данных')
        break

    name = input('ФИО: ')
    age = int(input('Возраст: '))
    weight = int(input('Вес: '))



    if age < 30 and 50 <= weight <= 120:
        print('--------------------------------------------------------------')
        print(name + ',' + ' возраст', str(age) + ',' + ' вес', str(weight) + 'кг - в отличном состоянии!')
        print('--------------------------------------------------------------')

    elif 30 <= age <= 40 and weight < 50 or weight > 120:
        print('--------------------------------------------------------------')
        print(name + ',' + ' возраст', str(age) + ',' + ' вес', str(weight) + 'кг - позаботьтесь о своем здоровьии!')
        print('--------------------------------------------------------------')
    #здесь возникает проблема, не знаю как её решить.
    elif age > 40 and weight < 50 or weight > 120:
        print('--------------------------------------------------------------')
        print(name + ',' + ' возраст', str(age) + ',' + ' вес', str(weight) + 'кг - обратитесь к врачу!')
        print('--------------------------------------------------------------')
    else:
        continue
